<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"d36aaba3ad6e8e96b19b00bd75137fcdf8600b664eace761dbd394d8f57ee592","plan_job_ref":"Job Test actions using target, replace, and exclude #20 at https://github.com/dflook/terraform-github-actions/actions/runs/17349369244","plan_out_hash":"ef5478f12d821d717b67e712e3ec61febb01fc0e252ee879606823cdf1ce8f9c","plan_hash":"f9cb5f486a5c7fde5cabbb72b1fdc5243eabcfece6c940d3e6cc3df3c7fb1148","plan_text_format":"diff","version":"99.0.0","closed":true} -->
Terraform plan in __tests/workflows/test-target-replace-exclude__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 5 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.also_exclude will be created
+   resource "random_string" "also_exclude" {
+       id          = (known after apply)
+       length      = 10
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = true
    }

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.exclude_me will be created
+   resource "random_string" "exclude_me" {
+       id          = (known after apply)
+       length      = 10
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = true
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.keep_me will be created
+   resource "random_string" "keep_me" {
+       id          = (known after apply)
+       length      = 10
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = true
    }

Plan: 5 to add, 0 to change, 2 to destroy.

Changes to Outputs:
+   also_exclude = (known after apply)
!~  count        = "9Rv6xqT5RZ" -> (known after apply)
+   exclude_me   = (known after apply)
!~  foreach      = "TmvbNbBzIp" -> (known after apply)
+   keep_me      = (known after apply)
```
</details>

:white_check_mark: Plan applied in [Test actions using target, replace, and exclude #20](https://github.com/dflook/terraform-github-actions/actions/runs/17349369244)
<details open><summary>Outputs</summary>

```hcl
also_exclude = "ZMdBY0RdJe"
count        = "lwIBVKS2JQ"
exclude_me   = "XT2ZLPRXyb"
foreach      = "HCTUo3Leg3"
keep_me      = "wLNx6z4wY0"
```
</details>